## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:98" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:98" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:02dd01c43c17ea49912cffeec81be67dcba6fd03ad0386a3fdf015cba4373212" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:0b59256e5284ddc59a30a8454a66f9420f711bfd8e28c9861bcb314b434f20ee"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 98 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "1e7a0f68fac6fcb2bb33ec96d2947868-6" -> "904a8c51cee6884bf43de42fe432012c"
        id                     = "graphql.904a8c51cee6884bf43de42fe432012c.zip"
        tags                   = {}
      ~ version_id             = "8Xtv9ZduXSVJD.Ysz0NbskYufA6CBX7f" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "b65238d2e7ce637461c8e3bcd74b478f-5" -> "001934362155a5aba63e5809098348b0"
        id                     = "processValidationJson.001934362155a5aba63e5809098348b0.zip"
        tags                   = {}
      ~ version_id             = "g3xn74XRaytKBAWQrkwP8K63RmcC8WqM" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.ae6ebf51bb29f931ef128e6961114130.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "479c4bad397e6633401188961a22619e-4" -> "b17c655f32e120515c5a1691736cb0d8"
      ~ id                     = "python.ae6ebf51bb29f931ef128e6961114130.zip" -> (known after apply)
      ~ key                    = "python.ae6ebf51bb29f931ef128e6961114130.zip" -> "python.b17c655f32e120515c5a1691736cb0d8.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "ae6ebf51bb29f931ef128e6961114130" -> "b17c655f32e120515c5a1691736cb0d8"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "c802JAckZ6jUnh8NOYTdDgdIcgskTiM." -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f1d47658ff085b5939934e5a1d51ceb8" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/200.html"
      ~ source_hash            = "f1d47658ff085b5939934e5a1d51ceb8" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "wes8W4pF2LGtLbDxCz3kRftxAqTpSlGZ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "959d67a9de00ca56ba0a83910de4c8b9" -> "60867b05c87877a1b51a4b98c9a37c68"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "959d67a9de00ca56ba0a83910de4c8b9" -> "60867b05c87877a1b51a4b98c9a37c68"
        tags                   = {}
      ~ version_id             = "yOHcklzADsjeRfLeaWgV5GL0N85l7syo" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "83e4df8f948faa9eb7eb340f342c4abb" -> "9523f2185ba82b988bbd2521fefab528"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "83e4df8f948faa9eb7eb340f342c4abb" -> "9523f2185ba82b988bbd2521fefab528"
        tags                   = {}
      ~ version_id             = "6LF5wDdFEuFlkWI.NdUCQqyXw9XIArM1" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f1d47658ff085b5939934e5a1d51ceb8" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/index.html"
      ~ source_hash            = "f1d47658ff085b5939934e5a1d51ceb8" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "R6Vrr3OtMcMQMZkXoTzMX6BdT6ctqYW6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.62a34f0f.js"] will be destroyed
  # (because key ["static/js/app.62a34f0f.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.62a34f0f.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "fbe1bc945179dbafa1c28fea4ddc0f23" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.62a34f0f.js" -> null
-       key                    = "dist/static/js/app.62a34f0f.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.62a34f0f.js" -> null
-       source_hash            = "fbe1bc945179dbafa1c28fea4ddc0f23" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "XqaUUUfsRJxw4lipP8KHJUBSssS.PfbD" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.62a34f0f.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.62a34f0f.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.62a34f0f.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.62a34f0f.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.62a34f0f.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.62a34f0f.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "iNf.5yfWyO9qKjBH2c6X1SxMEAdak8GO" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-17T00:50:57.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:65" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:65/invocations" -> (known after apply)
      ~ s3_key                         = "python.ae6ebf51bb29f931ef128e6961114130.zip" -> "python.b17c655f32e120515c5a1691736cb0d8.zip"
        tags                           = {}
      ~ version                        = "65" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "e6bb155d92b0b58618cee2ba491d2b0a623f0be2" -> "bb723513a8ad26697213bd9fec9bd02032a51219"
              ~ "DD_TAGS"                      = "git.commit.sha:e6bb155d92b0b58618cee2ba491d2b0a623f0be2,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bb723513a8ad26697213bd9fec9bd02032a51219,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "e6bb155d92b0b58618cee2ba491d2b0a623f0be2" -> "bb723513a8ad26697213bd9fec9bd02032a51219"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "65" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:113" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:113/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "113" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "e6bb155d92b0b58618cee2ba491d2b0a623f0be2" -> "bb723513a8ad26697213bd9fec9bd02032a51219"
              ~ "DD_TAGS"                            = "git.commit.sha:e6bb155d92b0b58618cee2ba491d2b0a623f0be2,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bb723513a8ad26697213bd9fec9bd02032a51219,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "e6bb155d92b0b58618cee2ba491d2b0a623f0be2" -> "bb723513a8ad26697213bd9fec9bd02032a51219"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "113" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::357150818708:policy/cpfreporter-processValidationJson-inline"
        name      = "cpfreporter-processValidationJson-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "s3:HeadObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::cpfreporter-reportingdata-357150818708-us-west-2/uploads/*/*/*/*/*.json"
                        Sid      = "AllowDownloadAndDeleteJsonObjects"
                    },
+                   {
+                       Action   = "kms:Decrypt"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb"
+                       Sid      = "DecryptPostgresSecret"
                    },
+                   {
+                       Action   = [
+                           "ssm:GetParameters",
+                           "ssm:GetParameter",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/cpfreporter/postgres/master_password"
+                       Sid      = "GetPostgresSecret"
                    },
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-SW5YR46V2LWC4ACK7BIYJPMPBM/postgres"
+                       Sid      = "PostgresIAMAuth"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:21" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:21/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "e6bb155d92b0b58618cee2ba491d2b0a623f0be2" -> "bb723513a8ad26697213bd9fec9bd02032a51219"
              ~ "DD_TAGS"                            = "git.commit.sha:e6bb155d92b0b58618cee2ba491d2b0a623f0be2,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bb723513a8ad26697213bd9fec9bd02032a51219,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "e6bb155d92b0b58618cee2ba491d2b0a623f0be2" -> "bb723513a8ad26697213bd9fec9bd02032a51219"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "21" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 11 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8715465231)*